Подготовим датасет к работе

In [40]:
import pandas as pd
import datetime

log = pd.read_csv('data/log.csv', header=None, names=['user_id', 'time', 'bet', 'win'])
display(log)

users = pd.read_csv('data/users.csv', encoding='koi8_r', sep='\t')
users.columns  = ['user_id', 'email', 'geo']
display(users)

sample = pd.read_csv('data/sample.csv')
display(sample.columns)

                              user_id                  time      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

     user_id                     email          geo
0   User_943       Accumanst@gmail.com       Ижевск
1   User_908         Advismowr@mail.ru       Ижевск
2   User_962           Anachso@ukr.net    Краснодар
3   User_973          Antecia@inbox.ru        Пермь
4   User_902        Balliaryva@ukr.net          NaN
..       ...                       ...          ...
95  User_959  UpdatesCurious@yahoo.com       Тюмень
96  User_901        V2artierso@mail.ru  Арзангелтск
97  User_970          Vashoterlo@bk.ru      Воронеж
98  User_965       Visuareda@yahoo.com      Воронеж
99  User_921              Aavast@ya.ru       Ижевск

[100 rows x 3 columns]

Index(['Name', 'City', 'Age', 'Profession'], dtype='object')

Создайте новый датафрейм log_win, в который будут входить только записи, где пользователь выиграл. Посчитайте, сколько таких записей, и сохраните в переменной win_count.

In [41]:
log_win = log[log['win'] > 0]
win_count = len(log_win)
print(win_count)

138

Создайте в sample заголовки колонок так, чтобы там были только маленькие буквы. Например, вместо 'Age' нужно сделать 'age':

In [42]:
display(sample.columns)
sample.columns = [c.lower() for c in sample.columns]
display(sample.columns)

Index(['Name', 'City', 'Age', 'Profession'], dtype='object')

Index(['name', 'city', 'age', 'profession'], dtype='object')

Посмотрите, сколько непустых значений в колонке City

In [43]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   city        10 non-null     object
 2   age         11 non-null     int64
 3   profession  11 non-null     object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

Создайте новый датафрейм sample2, в который будут входить только записи о людях в возрасте меньше 30 лет.

In [44]:
sample[sample['age'] < 30]

       name    city  age profession
0    Иванов  Москва   25     Клинер
2    Иванов  Москва   25     Клинер
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

Создайте новый датафрейм log_win, в который будут входить только записи, где пользователь выиграл. Посчитайте, сколько таких записей, и сохраните в переменной win_count.

In [45]:
log_win = log[log['win'] > 0]
win_count = len(log_win)
print(win_count)

138

Создайте новый датафрейм sample2, в который будут входить только записи о рабочих младше 30 лет.

In [46]:
sample[(sample['age'] < 30) & (sample['profession'] == 'Рабочий')]

       name    city  age profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

С помощью функции query найдите тех, у кого ставка меньше 2000, а выигрыш больше 0. Сохраните в новый датафрейм log2.

In [47]:
log.query('bet < 2000 & win > 0')

                              user_id                  time     bet     win
151  Запись пользователя № - user_982  [2019-01-16 21:54:22   100.0  4749.0
189  Запись пользователя № - user_964  [2019-01-21 18:34:44   200.0  4667.0
205  Запись пользователя № - user_931   [2019-01-22 5:26:59   300.0  4319.0
232  Запись пользователя № - user_998   [2019-01-25 8:57:20   500.0  5069.0
265  Запись пользователя № - user_998  [2019-01-29 10:37:55   500.0  6294.0
..                                ...                   ...     ...     ...
962  Запись пользователя № - user_976  [2019-04-19 14:18:45   400.0  5997.0
965  Запись пользователя № - user_900  [2019-04-19 19:31:48   900.0  6767.0
967  Запись пользователя № - user_975  [2019-04-19 22:25:15  1000.0  6108.0
981                            #error                   NaN   800.0  7035.0
991  Запись пользователя № - user_965  [2019-04-20 12:55:41   800.0  6927.0

[113 rows x 4 columns]

Функция contains не может работать с пустыми значениями: необходимо использовать параметр na = False

In [48]:
sample[sample.city.str.contains("о", na=False)]

           name         city  age profession
0        Иванов       Москва   25     Клинер
1           NaN    Волгоград   31   Менеджер
2        Иванов       Москва   25     Клинер
3       sidorov  Владивосток   43   Менеджер
5      Кузнецов         Сочи   19    Рабочий
7  Котлеревский   Йошкар-Ола   32    Рабочий
8    Завалишина    Чебоксары   36   Менеджер

Найдите записи, где в городах нет буквы "о", и сохраните в переменную sample4. Не забудьте про NaN и параметр na:

In [49]:
sample[~sample.city.str.contains("о", na=False)]

       name    city  age profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

Сохраните в переменную new_log датафрейм, из которого удалены записи с ошибкой в поле user_id:

In [50]:
log[~log.user_id.str.contains('#error')]

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

С помощью apply и лямбда-функции увеличьте возраст во всех записях на 1 год и сохраните в sample2:

In [51]:
sample2 = sample
sample2.age = sample2.age.apply(lambda x:x+1)
display(sample2)

            name         city  age profession
0         Иванов       Москва   26     Клинер
1            NaN    Волгоград   32   Менеджер
2         Иванов       Москва   26     Клинер
3        sidorov  Владивосток   44   Менеджер
4        _______        Курск   51   Водитель
5       Кузнецов         Сочи   20    Рабочий
6          Сажин       Сургут   30    Рабочий
7   Котлеревский   Йошкар-Ола   33    Рабочий
8     Завалишина    Чебоксары   37   Менеджер
9         Левина          NaN   56    Рабочий
10          Фикс         Рига   43    Рабочий

С помощью apply и lambda-функции замените все буквы в поле City на маленькие и сохраните в sample2. Вам может понадобиться функция s.lower().

Обратите внимание: когда в столбце есть пропущенные значения, необходимо в явном виде указывать, что это str.

In [52]:
sample2.city = sample2.city.apply(lambda x:str(x).lower())
display(sample2)

            name         city  age profession
0         Иванов       москва   26     Клинер
1            NaN    волгоград   32   Менеджер
2         Иванов       москва   26     Клинер
3        sidorov  владивосток   44   Менеджер
4        _______        курск   51   Водитель
5       Кузнецов         сочи   20    Рабочий
6          Сажин       сургут   30    Рабочий
7   Котлеревский   йошкар-ола   33    Рабочий
8     Завалишина    чебоксары   37   Менеджер
9         Левина          nan   56    Рабочий
10          Фикс         рига   43    Рабочий

Напишите функцию profession_code, которая на вход получает строку, а на выход возвращает:

* 0 — если на вход поступила строка "Рабочий"
* 1 — если на вход поступила строка "Менеджер"
* 2 — в любом другом случае

In [53]:
def profession_code(s):
    if s == 'Рабочий':
        return 0
    elif s == 'Менеджер':
        return 1
    else:
        return 2

Примените функцию profession_code для того, чтобы заменить поле Profession с помощью apply. Сохраните получившийся датафрейм в переменную sample2.

In [54]:
sample2.profession = sample2.profession.apply(lambda x:profession_code(x))
display(sample2)

            name         city  age  profession
0         Иванов       москва   26           2
1            NaN    волгоград   32           1
2         Иванов       москва   26           2
3        sidorov  владивосток   44           1
4        _______        курск   51           2
5       Кузнецов         сочи   20           0
6          Сажин       сургут   30           0
7   Котлеревский   йошкар-ола   33           0
8     Завалишина    чебоксары   37           1
9         Левина          nan   56           0
10          Фикс         рига   43           0

Напишите функцию age_category, которая на вход получает число, а на выход отдаёт:

* "молодой" — если возраст меньше 23
* "средний" — если возраст от 23 до 35
* "зрелый" — если возраст больше 35

In [56]:
def age_category(age):
    if age < 23:
        return 'молодой'
    elif age > 35:
        return 'зрелый'
    else:
        return 'средний'

Примените функцию age_category и apply, чтобы создать новую колонку в sample под названием 'Age_category'. Не забудьте загрузить датафрейм.

Вспомним, как создать новую колонку: `df['new_column'] = df.old_column.apply(func)`

In [58]:
sample['age_category'] = sample.age.apply(lambda x:age_category(x))
display(sample)

            name         city  age  profession age_category
0         Иванов       москва   26           2      средний
1            NaN    волгоград   32           1      средний
2         Иванов       москва   26           2      средний
3        sidorov  владивосток   44           1       зрелый
4        _______        курск   51           2       зрелый
5       Кузнецов         сочи   20           0      молодой
6          Сажин       сургут   30           0      средний
7   Котлеревский   йошкар-ола   33           0      средний
8     Завалишина    чебоксары   37           1       зрелый
9         Левина          nan   56           0       зрелый
10          Фикс         рига   43           0       зрелый

Преобразуем поле user_id в датафрейме log, оставив только идентификатор пользователя. Например, вместо "Запись пользователя № — user_974" должно остаться только "user_974".

На месте записей с ошибками в user_id должна быть пустая строка "". Сделайте это через apply и новую функцию, которую вы создадите. Результат сохраните в log:

In [59]:
def get_user_id(s):
    if s == '#error':
        return ''
    else:
        return s.split('- ')[1]
        
log.user_id = log.user_id.apply(lambda s:get_user_id(s))
display(log)

      user_id                  time      bet      win
0    user_919  [2019-01-01 14:06:51      NaN      NaN
1    user_973  [2019-01-01 14:51:16      NaN      NaN
2    user_903  [2019-01-01 16:31:16      NaN      NaN
3    user_954  [2019-01-01 17:17:51      NaN      NaN
4    user_954  [2019-01-01 21:31:18      NaN      NaN
..        ...                   ...      ...      ...
995  user_984   [2019-04-20 9:59:58   9754.0      NaN
996                             NaN  10054.0  29265.0
997                             NaN  10454.0      NaN
998                             NaN   1000.0      NaN
999                             NaN  10754.0      NaN

[1000 rows x 4 columns]

Загрузите log.csv в log. Удалите квадратную скобку из первой строки в столбце time, чтобы привести его к более привычному формату: t равен log.time[0]. Сохраните результат в t:

In [60]:
t = log.time[0]
# Удалите квадратную скобку из t, чтобы привести его к более привычному формату
t = t[1:]
display(t)

'2019-01-01 14:06:51'

Уберите ненужную скобку "[" из поля в time. Результат сохраните в log:

In [61]:
log.time = log.time.apply(lambda s: str(s)[1:] if str(s).startswith('[') else s)
display(log)

      user_id                 time      bet      win
0    user_919  2019-01-01 14:06:51      NaN      NaN
1    user_973  2019-01-01 14:51:16      NaN      NaN
2    user_903  2019-01-01 16:31:16      NaN      NaN
3    user_954  2019-01-01 17:17:51      NaN      NaN
4    user_954  2019-01-01 21:31:18      NaN      NaN
..        ...                  ...      ...      ...
995  user_984   2019-04-20 9:59:58   9754.0      NaN
996                            NaN  10054.0  29265.0
997                            NaN  10454.0      NaN
998                            NaN   1000.0      NaN
999                            NaN  10754.0      NaN

[1000 rows x 4 columns]

In [ ]:
Соединим всё, что мы делали, и очистим файл log.csv. А именно:

* прочитаем файл в переменную log;
* добавим названия колонок user_id, time, bet, win;
* удалим строки, которые содержат значения user_id с ошибками;
* оставим в user_id только значения идентификатора;
* уберём начальную скобку из поля time.

In [62]:
def get_user_id(s):
    if s == '#error':
        return ''
    else:
        return s.split('- ')[1]

final_log = pd.read_csv("data/log.csv",header=None)
final_log.columns = ['user_id','time', 'bet','win']
final_log = final_log[~final_log.user_id.str.contains('#error')]
final_log.user_id = final_log.user_id.apply(lambda s:get_user_id(s))
final_log.time = final_log.time.apply(lambda s: str(s)[1:] if str(s).startswith('[') else s)
display(final_log)

FileNotFoundError: [Errno 2] File log.csv does not exist: 'log.csv'